dima2/src/Documents/РасчетСпецстажаСотрудников/РасчетСпецстажаСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РасчетСпецстажаСотрудников</name>
  <registerRecords>InformationRegister.СпецстажСотрудников</registerRecords>
  <attributes>
    <name>ПериодРегистрации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>КраткийСоставДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеОрганизации</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Спецстаж</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>ОснованияСпецСтажа</name>
      <type>
        <types>CatalogRef.ОснованияСпециальногоСтажа</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаВремени</name>
      <type>
        <types>EnumRef.ЕдиницыВремениУчетаСпецстажа</types>
      </type>
    </attributes>
    <attributes>
      <name>ГрафикНормы</name>
      <type>
        <types>CatalogRef.ГрафикиРаботыСотрудников</types>
      </type>
    </attributes>
    <attributes>
      <name>Сезонность</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Результат</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Норма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Приказ</name>
      <type>
        <types>DocumentRef.АттестацияРабочихМестДляУчетаСпецстажа</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ФизическиеЛица</name>
    <attributes>
      <name>ФизическоеЛицо</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

dima2/src/InformationRegisters/СпецстажСотрудников/СпецстажСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СпецстажСотрудников</name>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Результат</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Норма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаВремени</name>
    <type>
      <types>EnumRef.ЕдиницыВремениУчетаСпецстажа</types>
    </type>
  </attributes>
  <attributes>
    <name>Сезонность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Приказ</name>
    <type>
      <types>DocumentRef.АттестацияРабочихМестДляУчетаСпецстажа</types>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОснованияСпециальногоСтажа</name>
    <type>
      <types>CatalogRef.ОснованияСпециальногоСтажа</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПериодРегистрации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

dima2/src/Documents/РасчетСпецстажаСотрудников/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Подсистема "Управление доступом".

// Процедура ЗаполнитьНаборыЗначенийДоступа по свойствам объекта заполняет наборы значений доступа
// в таблице с полями:
//    НомерНабора     - Число                                     (необязательно, если набор один),
//    ВидДоступа      - ПланВидовХарактеристикСсылка.ВидыДоступа, (обязательно),
//    ЗначениеДоступа - Неопределено, СправочникСсылка или др.    (обязательно),
//    Чтение          - Булево (необязательно, если набор для всех прав) устанавливается для одной строки набора,
//    Добавление      - Булево (необязательно, если набор для всех прав) устанавливается для одной строки набора,
//    Изменение       - Булево (необязательно, если набор для всех прав) устанавливается для одной строки набора,
//    Удаление        - Булево (необязательно, если набор для всех прав) устанавливается для одной строки набора,
//
//  Вызывается из процедуры УправлениеДоступомСлужебный.ЗаписатьНаборыЗначенийДоступа(),
// если объект зарегистрирован в "ПодпискаНаСобытие.ЗаписатьНаборыЗначенийДоступа" и
// из таких же процедур объектов, у которых наборы значений доступа зависят от наборов этого
// объекта (в этом случае объект зарегистрирован в "ПодпискаНаСобытие.ЗаписатьЗависимыеНаборыЗначенийДоступа").
//
// Параметры:
//  Таблица      - ТабличнаяЧасть,
//                 РегистрСведенийНаборЗаписей.НаборыЗначенийДоступа,
//                 ТаблицаЗначений, возвращаемая УправлениеДоступом.ТаблицаНаборыЗначенийДоступа().
//
Процедура ЗаполнитьНаборыЗначенийДоступа(Таблица) Экспорт
	
	ЗарплатаКадры.ЗаполнитьНаборыПоОрганизацииИФизическимЛицам(ЭтотОбъект, Таблица, "Организация", "ФизическиеЛица.ФизическоеЛицо");
	
КонецПроцедуры

#КонецОбласти

Процедура ОбработкаПроведения(Отказ, Режим)
	
	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	ДанныеДляПроведения = ДанныеДляПроведения(ЭтотОбъект.Ссылка);
	ПроверитьЗаполнениеСтрокиСпецстажа(ДанныеДляПроведения, Отказ);
	ДвижениеПоРегиструСпецстажСотрудников(ДанныеДляПроведения, Движения, Ссылка);
		
КонецПроцедуры	

Функция ДанныеДляПроведения(Документ)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокументСсылка", Документ);
	Запрос.Текст = "ВЫБРАТЬ
	|	СтрокиДокумента.НомерСтроки КАК НомерСтроки,
	|	СтрокиДокумента.Сотрудник,
	|	СтрокиДокумента.ОснованияСпецСтажа КАК ОснованияСпециальногоСтажа,
	|	СтрокиДокумента.ЕдиницаВремени,
	|	СтрокиДокумента.ДатаНачала,
	|	СтрокиДокумента.ГрафикНормы,
	|	СтрокиДокумента.Сезонность,
	|	СтрокиДокумента.Результат,
	|	СтрокиДокумента.Норма,
	|	СтрокиДокумента.Приказ,
	|	СтрокиДокумента.ДатаОкончания,
	|	РасчетСпецстажаСотрудников.Дата,
	|	РасчетСпецстажаСотрудников.ПериодРегистрации,
	|	РасчетСпецстажаСотрудников.Организация
	|ИЗ
	|	Документ.РасчетСпецстажаСотрудников.Спецстаж КАК СтрокиДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РасчетСпецстажаСотрудников КАК РасчетСпецстажаСотрудников
	|		ПО СтрокиДокумента.Ссылка = РасчетСпецстажаСотрудников.Ссылка
	|ГДЕ
	|	СтрокиДокумента.Ссылка = &ДокументСсылка";
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции // СформироватьЗапросПоСпецстажу()

Процедура ДвижениеПоРегиструСпецстажСотрудников(Данные, Движения, Ссылка)
	
	Для Каждого Строка ИЗ Данные Цикл
		НовыеДвижения = Движения.СпецстажСотрудников.Добавить();
		ЗаполнитьЗначенияСвойств(НовыеДвижения,Строка);
	КонецЦикла;
	Движения.СпецстажСотрудников.Записывать = Истина;
	Движения.СпецстажСотрудников.Записать();
	
КонецПроцедуры


// Проверяет правильность заполнения реквизитов в строке ТЧ "Спецстаж" документа.
// Если какой-то из реквизтов, влияющий на проведение не заполнен или
// заполнен не корректно, то выставляется флаг отказа в проведении.
// Проверка выполняется по выборке из результата запроса по строке ТЧ документа,
// все проверяемые реквизиты должны быть включены в выборку.
//
// Параметры: 
//  ВыборкаПоШапкеДокумента		- выборка из результата запроса по шапке документа,
//  ВыборкаПоСтрокамДокумента	- спозиционированная на определеной строке выборка 
//  							  из результата запроса
//  Отказ 						- флаг отказа в проведении.
//
Процедура ПроверитьЗаполнениеСтрокиСпецстажа(ДанныеДляПроведения, Отказ)
	
	Для каждого Строка ИЗ ДанныеДляПроведения Цикл
		СтрокаНачалаСообщенияОбОшибке = НСтр("ru='В строке номер ';uk='У рядку номер '") + СокрЛП(Строка.НомерСтроки) + " ";
		
		Если НачалоМесяца(Строка.ДатаНачала) <> НачалоМесяца(Строка.ПериодРегистрации) Тогда
			СтрокаОшибки = СтрокаНачалаСообщенияОбОшибке + НСтр("ru='дата начала не соответствует периоду регистрации документа!';uk='дата початку не відповідає періоду реєстрації документа!'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрокаОшибки,,,,Отказ);
		ИначеЕсли НачалоМесяца(Строка.ДатаОкончания) <> НачалоМесяца(Строка.ПериодРегистрации) Тогда
			СтрокаОшибки = СтрокаНачалаСообщенияОбОшибке + НСтр("ru='дата окончания не соответствует периоду регистрации документа!';uk='дата закінчення не відповідає періоду реєстрації документа!'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрокаОшибки,,,,Отказ);
		ИначеЕсли Строка.ДатаНачала > Строка.ДатаОкончания Тогда
			СтрокаОшибки = СтрокаНачалаСообщенияОбОшибке + НСтр("ru='дата окончания должна быть больше даты начала!';uk='дата закінчення повинна бути більше дати початку!'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрокаОшибки,,,,Отказ);
		КонецЕсли;
	КонецЦикла;	
КонецПроцедуры // ПроверитьЗаполнениеСтрокиСпецстажа()

#КонецЕсли
